dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/pin_packages/cy_hal_psoc6_02_100_wlcsp.c
/***************************************************************************//**
* \file cy_hal_psoc6_02_100_wlcsp.c
*
* \brief
* PSoC6_02 device GPIO HAL header for 100-WLCSP package
*
* \note
* Generator version: 1.4.7041.28143
*
********************************************************************************
* \copyright
* Copyright 2016-2019, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_device_headers.h"
#include "cy_hal_hw_types.h"

#if defined(_GPIO_PSOC6_02_100_WLCSP_H_)
#include "pin_packages/cy_hal_psoc6_02_100_wlcsp.h"

/* Hardware Blocks */
static const cy_resource_inst_t CY_I2S_0 = { CY_RSC_I2S, 0, 0 };
static const cy_resource_inst_t CY_PDM_0 = { CY_RSC_PDM, 0, 0 };
static const cy_resource_inst_t CY_I2S_1 = { CY_RSC_I2S, 1, 0 };
static const cy_resource_inst_t CY_LPCOMP_0_0 = { CY_RSC_LPCOMP, 0, 0 };
static const cy_resource_inst_t CY_SCB_0 = { CY_RSC_SCB, 0, 0 };
static const cy_resource_inst_t CY_SCB_1 = { CY_RSC_SCB, 1, 0 };
static const cy_resource_inst_t CY_SCB_10 = { CY_RSC_SCB, 10, 0 };
static const cy_resource_inst_t CY_SCB_11 = { CY_RSC_SCB, 11, 0 };
static const cy_resource_inst_t CY_SCB_12 = { CY_RSC_SCB, 12, 0 };
static const cy_resource_inst_t CY_SCB_2 = { CY_RSC_SCB, 2, 0 };
static const cy_resource_inst_t CY_SCB_3 = { CY_RSC_SCB, 3, 0 };
static const cy_resource_inst_t CY_SCB_4 = { CY_RSC_SCB, 4, 0 };
static const cy_resource_inst_t CY_SCB_5 = { CY_RSC_SCB, 5, 0 };
static const cy_resource_inst_t CY_SCB_6 = { CY_RSC_SCB, 6, 0 };
static const cy_resource_inst_t CY_SCB_7 = { CY_RSC_SCB, 7, 0 };
static const cy_resource_inst_t CY_SCB_8 = { CY_RSC_SCB, 8, 0 };
static const cy_resource_inst_t CY_SCB_9 = { CY_RSC_SCB, 9, 0 };
static const cy_resource_inst_t CY_SDHC_0 = { CY_RSC_SDHC, 0, 0 };
static const cy_resource_inst_t CY_SDHC_1 = { CY_RSC_SDHC, 1, 0 };
static const cy_resource_inst_t CY_SMIF_0 = { CY_RSC_SMIF, 0, 0 };
static const cy_resource_inst_t CY_TCPWM_0_0 = { CY_RSC_TCPWM, 0, 0 };
static const cy_resource_inst_t CY_TCPWM_0_1 = { CY_RSC_TCPWM, 0, 1 };
static const cy_resource_inst_t CY_TCPWM_0_2 = { CY_RSC_TCPWM, 0, 2 };
static const cy_resource_inst_t CY_TCPWM_0_3 = { CY_RSC_TCPWM, 0, 3 };
static const cy_resource_inst_t CY_TCPWM_0_4 = { CY_RSC_TCPWM, 0, 4 };
static const cy_resource_inst_t CY_TCPWM_0_5 = { CY_RSC_TCPWM, 0, 5 };
static const cy_resource_inst_t CY_TCPWM_0_6 = { CY_RSC_TCPWM, 0, 6 };
static const cy_resource_inst_t CY_TCPWM_0_7 = { CY_RSC_TCPWM, 0, 7 };
static const cy_resource_inst_t CY_TCPWM_1_0 = { CY_RSC_TCPWM, 1, 0 };
static const cy_resource_inst_t CY_TCPWM_1_1 = { CY_RSC_TCPWM, 1, 1 };
static const cy_resource_inst_t CY_TCPWM_1_10 = { CY_RSC_TCPWM, 1, 10 };
static const cy_resource_inst_t CY_TCPWM_1_11 = { CY_RSC_TCPWM, 1, 11 };
static const cy_resource_inst_t CY_TCPWM_1_12 = { CY_RSC_TCPWM, 1, 12 };
static const cy_resource_inst_t CY_TCPWM_1_13 = { CY_RSC_TCPWM, 1, 13 };
static const cy_resource_inst_t CY_TCPWM_1_15 = { CY_RSC_TCPWM, 1, 15 };
static const cy_resource_inst_t CY_TCPWM_1_16 = { CY_RSC_TCPWM, 1, 16 };
static const cy_resource_inst_t CY_TCPWM_1_17 = { CY_RSC_TCPWM, 1, 17 };
static const cy_resource_inst_t CY_TCPWM_1_18 = { CY_RSC_TCPWM, 1, 18 };
static const cy_resource_inst_t CY_TCPWM_1_2 = { CY_RSC_TCPWM, 1, 2 };
static const cy_resource_inst_t CY_TCPWM_1_20 = { CY_RSC_TCPWM, 1, 20 };
static const cy_resource_inst_t CY_TCPWM_1_21 = { CY_RSC_TCPWM, 1, 21 };
static const cy_resource_inst_t CY_TCPWM_1_22 = { CY_RSC_TCPWM, 1, 22 };
static const cy_resource_inst_t CY_TCPWM_1_23 = { CY_RSC_TCPWM, 1, 23 };
static const cy_resource_inst_t CY_TCPWM_1_3 = { CY_RSC_TCPWM, 1, 3 };
static const cy_resource_inst_t CY_TCPWM_1_4 = { CY_RSC_TCPWM, 1, 4 };
static const cy_resource_inst_t CY_TCPWM_1_5 = { CY_RSC_TCPWM, 1, 5 };
static const cy_resource_inst_t CY_TCPWM_1_6 = { CY_RSC_TCPWM, 1, 6 };
static const cy_resource_inst_t CY_TCPWM_1_7 = { CY_RSC_TCPWM, 1, 7 };
static const cy_resource_inst_t CY_TCPWM_1_8 = { CY_RSC_TCPWM, 1, 8 };
static const cy_resource_inst_t CY_TCPWM_1_9 = { CY_RSC_TCPWM, 1, 9 };
static const cy_resource_inst_t CY_TCPWM_1_14 = { CY_RSC_TCPWM, 1, 14 };

/* Pin connections */
/* Connections for: audioss_clk_i2s_if */
const cy_resource_pin_mapping_t cy_pin_map_audioss_clk_i2s_if[4] = {
    {P5_0, &CY_I2S_0, CY_PIN_IN_FUNCTION(P5_0_AUDIOSS0_CLK_I2S_IF)},
    {P9_0, &CY_I2S_0, CY_PIN_IN_FUNCTION(P9_0_AUDIOSS0_CLK_I2S_IF)},
    {P11_0, &CY_I2S_1, CY_PIN_IN_FUNCTION(P11_0_AUDIOSS1_CLK_I2S_IF)},
    {P13_0, &CY_I2S_1, CY_PIN_IN_FUNCTION(P13_0_AUDIOSS1_CLK_I2S_IF)},
};

/* Connections for: audioss_pdm_clk */
const cy_resource_pin_mapping_t cy_pin_map_audioss_pdm_clk[2] = {
    {P10_4, &CY_PDM_0, CY_PIN_OUT_FUNCTION(P10_4_AUDIOSS0_PDM_CLK)},
    {P12_4, &CY_PDM_0, CY_PIN_OUT_FUNCTION(P12_4_AUDIOSS0_PDM_CLK)},
};

/* Connections for: audioss_pdm_data */
const cy_resource_pin_mapping_t cy_pin_map_audioss_pdm_data[2] = {
    {P10_5, &CY_PDM_0, CY_PIN_IN_FUNCTION(P10_5_AUDIOSS0_PDM_DATA)},
    {P12_5, &CY_PDM_0, CY_PIN_IN_FUNCTION(P12_5_AUDIOSS0_PDM_DATA)},
};

/* Connections for: audioss_rx_sck */
const cy_resource_pin_mapping_t cy_pin_map_audioss_rx_sck[4] = {
    {P5_4, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P5_4_AUDIOSS0_RX_SCK)},
    {P9_4, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P9_4_AUDIOSS0_RX_SCK)},
    {P11_4, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P11_4_AUDIOSS1_RX_SCK)},
    {P13_4, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P13_4_AUDIOSS1_RX_SCK)},
};

/* Connections for: audioss_rx_sdi */
const cy_resource_pin_mapping_t cy_pin_map_audioss_rx_sdi[3] = {
    {P5_6, &CY_I2S_0, CY_PIN_IN_FUNCTION(P5_6_AUDIOSS0_RX_SDI)},
    {P11_6, &CY_I2S_1, CY_PIN_IN_FUNCTION(P11_6_AUDIOSS1_RX_SDI)},
    {P13_6, &CY_I2S_1, CY_PIN_IN_FUNCTION(P13_6_AUDIOSS1_RX_SDI)},
};

/* Connections for: audioss_rx_ws */
const cy_resource_pin_mapping_t cy_pin_map_audioss_rx_ws[3] = {
    {P5_5, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P5_5_AUDIOSS0_RX_WS)},
    {P11_5, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P11_5_AUDIOSS1_RX_WS)},
    {P13_5, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P13_5_AUDIOSS1_RX_WS)},
};

/* Connections for: audioss_tx_sck */
const cy_resource_pin_mapping_t cy_pin_map_audioss_tx_sck[4] = {
    {P5_1, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P5_1_AUDIOSS0_TX_SCK)},
    {P9_1, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P9_1_AUDIOSS0_TX_SCK)},
    {P11_1, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P11_1_AUDIOSS1_TX_SCK)},
    {P13_1, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P13_1_AUDIOSS1_TX_SCK)},
};

/* Connections for: audioss_tx_sdo */
const cy_resource_pin_mapping_t cy_pin_map_audioss_tx_sdo[4] = {
    {P5_3, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P5_3_AUDIOSS0_TX_SDO)},
    {P9_3, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P9_3_AUDIOSS0_TX_SDO)},
    {P11_3, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P11_3_AUDIOSS1_TX_SDO)},
    {P13_3, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P13_3_AUDIOSS1_TX_SDO)},
};

