dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/pin_packages/cy_hal_psoc6_02_100_wlcsp.c
/* Connections for: audioss_tx_ws */
const cy_resource_pin_mapping_t cy_pin_map_audioss_tx_ws[4] = {
    {P5_2, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P5_2_AUDIOSS0_TX_WS)},
    {P9_2, &CY_I2S_0, CY_PIN_OUT_FUNCTION(P9_2_AUDIOSS0_TX_WS)},
    {P11_2, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P11_2_AUDIOSS1_TX_WS)},
    {P13_2, &CY_I2S_1, CY_PIN_OUT_FUNCTION(P13_2_AUDIOSS1_TX_WS)},
};

/* Connections for: lpcomp_dsi_comp0 */
const cy_resource_pin_mapping_t cy_pin_map_lpcomp_dsi_comp0[1] = {
    {P8_2, &CY_LPCOMP_0_0, CY_PIN_OUT_FUNCTION(P8_2_LPCOMP_DSI_COMP0)},
};

/* Connections for: lpcomp_dsi_comp1 */
const cy_resource_pin_mapping_t cy_pin_map_lpcomp_dsi_comp1[1] = {
    {P8_3, &CY_LPCOMP_0_0, CY_PIN_OUT_FUNCTION(P8_3_LPCOMP_DSI_COMP1)},
};

/* Connections for: scb_i2c_scl */
const cy_resource_pin_mapping_t cy_pin_map_scb_i2c_scl[19] = {
    {P0_2, &CY_SCB_0, CY_PIN_OD_FUNCTION(P0_2_SCB0_I2C_SCL)},
    {P1_0, &CY_SCB_7, CY_PIN_OD_FUNCTION(P1_0_SCB7_I2C_SCL)},
    {P2_0, &CY_SCB_1, CY_PIN_OD_FUNCTION(P2_0_SCB1_I2C_SCL)},
    {P2_4, &CY_SCB_9, CY_PIN_OD_FUNCTION(P2_4_SCB9_I2C_SCL)},
    {P5_0, &CY_SCB_5, CY_PIN_OD_FUNCTION(P5_0_SCB5_I2C_SCL)},
    {P5_4, &CY_SCB_10, CY_PIN_OD_FUNCTION(P5_4_SCB10_I2C_SCL)},
    {P6_0, &CY_SCB_3, CY_PIN_OD_FUNCTION(P6_0_SCB3_I2C_SCL)},
    {P6_0, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_0_SCB8_I2C_SCL)},
    {P6_4, &CY_SCB_6, CY_PIN_OD_FUNCTION(P6_4_SCB6_I2C_SCL)},
    {P6_4, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_4_SCB8_I2C_SCL)},
    {P7_0, &CY_SCB_4, CY_PIN_OD_FUNCTION(P7_0_SCB4_I2C_SCL)},
    {P8_0, &CY_SCB_4, CY_PIN_OD_FUNCTION(P8_0_SCB4_I2C_SCL)},
    {P8_4, &CY_SCB_11, CY_PIN_OD_FUNCTION(P8_4_SCB11_I2C_SCL)},
    {P9_0, &CY_SCB_2, CY_PIN_OD_FUNCTION(P9_0_SCB2_I2C_SCL)},
    {P10_0, &CY_SCB_1, CY_PIN_OD_FUNCTION(P10_0_SCB1_I2C_SCL)},
    {P11_0, &CY_SCB_5, CY_PIN_OD_FUNCTION(P11_0_SCB5_I2C_SCL)},
    {P12_0, &CY_SCB_6, CY_PIN_OD_FUNCTION(P12_0_SCB6_I2C_SCL)},
    {P13_0, &CY_SCB_6, CY_PIN_OD_FUNCTION(P13_0_SCB6_I2C_SCL)},
    {P13_4, &CY_SCB_12, CY_PIN_OD_FUNCTION(P13_4_SCB12_I2C_SCL)},
};

/* Connections for: scb_i2c_sda */
const cy_resource_pin_mapping_t cy_pin_map_scb_i2c_sda[18] = {
    {P0_3, &CY_SCB_0, CY_PIN_OD_FUNCTION(P0_3_SCB0_I2C_SDA)},
    {P1_1, &CY_SCB_7, CY_PIN_OD_FUNCTION(P1_1_SCB7_I2C_SDA)},
    {P2_1, &CY_SCB_1, CY_PIN_OD_FUNCTION(P2_1_SCB1_I2C_SDA)},
    {P2_5, &CY_SCB_9, CY_PIN_OD_FUNCTION(P2_5_SCB9_I2C_SDA)},
    {P5_1, &CY_SCB_5, CY_PIN_OD_FUNCTION(P5_1_SCB5_I2C_SDA)},
    {P5_5, &CY_SCB_10, CY_PIN_OD_FUNCTION(P5_5_SCB10_I2C_SDA)},
    {P6_1, &CY_SCB_3, CY_PIN_OD_FUNCTION(P6_1_SCB3_I2C_SDA)},
    {P6_1, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_1_SCB8_I2C_SDA)},
    {P6_5, &CY_SCB_6, CY_PIN_OD_FUNCTION(P6_5_SCB6_I2C_SDA)},
    {P6_5, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_5_SCB8_I2C_SDA)},
    {P7_1, &CY_SCB_4, CY_PIN_OD_FUNCTION(P7_1_SCB4_I2C_SDA)},
    {P8_1, &CY_SCB_4, CY_PIN_OD_FUNCTION(P8_1_SCB4_I2C_SDA)},
    {P9_1, &CY_SCB_2, CY_PIN_OD_FUNCTION(P9_1_SCB2_I2C_SDA)},
    {P10_1, &CY_SCB_1, CY_PIN_OD_FUNCTION(P10_1_SCB1_I2C_SDA)},
    {P11_1, &CY_SCB_5, CY_PIN_OD_FUNCTION(P11_1_SCB5_I2C_SDA)},
    {P12_1, &CY_SCB_6, CY_PIN_OD_FUNCTION(P12_1_SCB6_I2C_SDA)},
    {P13_1, &CY_SCB_6, CY_PIN_OD_FUNCTION(P13_1_SCB6_I2C_SDA)},
    {P13_5, &CY_SCB_12, CY_PIN_OD_FUNCTION(P13_5_SCB12_I2C_SDA)},
};

/* Connections for: scb_spi_clk */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_clk[14] = {
    {P0_4, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_4_SCB0_SPI_CLK)},
    {P2_2, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_2_SCB1_SPI_CLK)},
    {P5_2, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_2_SCB5_SPI_CLK)},
    {P6_2, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P6_2_SCB3_SPI_CLK)},
    {P6_2, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_2_SCB8_SPI_CLK)},
    {P6_6, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_6_SCB6_SPI_CLK)},
    {P6_6, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_6_SCB8_SPI_CLK)},
    {P7_2, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_2_SCB4_SPI_CLK)},
    {P8_2, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_2_SCB4_SPI_CLK)},
    {P9_2, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_2_SCB2_SPI_CLK)},
    {P10_2, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_2_SCB1_SPI_CLK)},
    {P11_2, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_2_SCB5_SPI_CLK)},
    {P12_2, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_2_SCB6_SPI_CLK)},
    {P13_2, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P13_2_SCB6_SPI_CLK)},
};

/* Connections for: scb_spi_miso */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_miso[15] = {
    {P0_3, &CY_SCB_0, CY_PIN_IN_FUNCTION(P0_3_SCB0_SPI_MISO)},
    {P1_1, &CY_SCB_7, CY_PIN_IN_FUNCTION(P1_1_SCB7_SPI_MISO)},
    {P2_1, &CY_SCB_1, CY_PIN_IN_FUNCTION(P2_1_SCB1_SPI_MISO)},
    {P5_1, &CY_SCB_5, CY_PIN_IN_FUNCTION(P5_1_SCB5_SPI_MISO)},
    {P6_1, &CY_SCB_3, CY_PIN_IN_FUNCTION(P6_1_SCB3_SPI_MISO)},
    {P6_1, &CY_SCB_8, CY_PIN_IN_FUNCTION(P6_1_SCB8_SPI_MISO)},
    {P6_5, &CY_SCB_6, CY_PIN_IN_FUNCTION(P6_5_SCB6_SPI_MISO)},
    {P6_5, &CY_SCB_8, CY_PIN_IN_FUNCTION(P6_5_SCB8_SPI_MISO)},
    {P7_1, &CY_SCB_4, CY_PIN_IN_FUNCTION(P7_1_SCB4_SPI_MISO)},
    {P8_1, &CY_SCB_4, CY_PIN_IN_FUNCTION(P8_1_SCB4_SPI_MISO)},
    {P9_1, &CY_SCB_2, CY_PIN_IN_FUNCTION(P9_1_SCB2_SPI_MISO)},
    {P10_1, &CY_SCB_1, CY_PIN_IN_FUNCTION(P10_1_SCB1_SPI_MISO)},
    {P11_1, &CY_SCB_5, CY_PIN_IN_FUNCTION(P11_1_SCB5_SPI_MISO)},
    {P12_1, &CY_SCB_6, CY_PIN_IN_FUNCTION(P12_1_SCB6_SPI_MISO)},
    {P13_1, &CY_SCB_6, CY_PIN_IN_FUNCTION(P13_1_SCB6_SPI_MISO)},
};

/* Connections for: scb_spi_mosi */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_mosi[15] = {
    {P0_2, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_2_SCB0_SPI_MOSI)},
    {P1_0, &CY_SCB_7, CY_PIN_OUT_FUNCTION(P1_0_SCB7_SPI_MOSI)},
    {P2_0, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_0_SCB1_SPI_MOSI)},
    {P5_0, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_0_SCB5_SPI_MOSI)},
    {P6_0, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P6_0_SCB3_SPI_MOSI)},
    {P6_0, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_0_SCB8_SPI_MOSI)},
    {P6_4, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_4_SCB6_SPI_MOSI)},
    {P6_4, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_4_SCB8_SPI_MOSI)},
    {P7_0, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_0_SCB4_SPI_MOSI)},
    {P8_0, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_0_SCB4_SPI_MOSI)},
    {P9_0, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_0_SCB2_SPI_MOSI)},
    {P10_0, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_0_SCB1_SPI_MOSI)},
    {P11_0, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_0_SCB5_SPI_MOSI)},
    {P12_0, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_0_SCB6_SPI_MOSI)},
    {P13_0, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P13_0_SCB6_SPI_MOSI)},
};

/* Connections for: scb_spi_select0 */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_select0[14] = {
    {P0_5, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_5_SCB0_SPI_SELECT0)},
    {P2_3, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_3_SCB1_SPI_SELECT0)},
    {P5_3, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_3_SCB5_SPI_SELECT0)},
    {P6_3, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P6_3_SCB3_SPI_SELECT0)},
    {P6_3, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_3_SCB8_SPI_SELECT0)},
    {P6_7, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_7_SCB6_SPI_SELECT0)},
    {P6_7, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_7_SCB8_SPI_SELECT0)},
    {P7_3, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_3_SCB4_SPI_SELECT0)},
    {P8_3, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_3_SCB4_SPI_SELECT0)},
    {P9_3, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_3_SCB2_SPI_SELECT0)},
    {P10_3, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_3_SCB1_SPI_SELECT0)},
    {P11_3, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_3_SCB5_SPI_SELECT0)},
    {P12_3, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_3_SCB6_SPI_SELECT0)},
    {P13_3, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P13_3_SCB6_SPI_SELECT0)},
};

